driver-tests/sqlse/sqlserver/Sqlse1103_SQL/InsertParamJbi/test/Sqlse1103_SQL/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sql="http://com.sun.jbi/sqlse/sqlseengine">
  <soapenv:Body>
    <sql:InsertParamRequest>
      <sql:param1>800</sql:param1>
      <sql:param2>800</sql:param2>
      <sql:param3>FirstName1</sql:param3>
      <sql:param4> </sql:param4>
      <sql:param5>2006-06-02 08:18:21.753</sql:param5>
      <sql:param6>600</sql:param6>
    </sql:InsertParamRequest>
  </soapenv:Body>
</soapenv:Envelope>